class TestData:
    questions = {
        0 : 
            'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
        2 : 
            'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
        3 : 
            'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
        4 : 
            'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
        5 : 
            'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
        6 : 
            'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
        7 : 
            'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
        8 : 
            'Да, обязательно. Всем самокатов! И Москве, и Московской области.',
    }


    order_data = {
        'first_name' : 'Антон',
        'last_name' : 'Иванов',
        'address' :  'Санкт-Петербург',
        'metro_station' : 'Черкизовская',
        'telephone' :  '89213376585',
        'date' : '27.06.2025',
        'rental_period' : 'сутки',
        'scooter_color' : 'чёрный жемчуг',
        'comment' : 'Test комментарий'
    }


    order_page_url = 'https://qa-scooter.praktikum-services.ru/order'
    home_page_url = 'https://qa-scooter.praktikum-services.ru/'
